tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Command-line interface for SQLite
brew "sqlite"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# GNU binary tools for native development
brew "binutils"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Configurable static site generator
brew "hugo"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Implementation of 'offline nested' attack by Nethemba
brew "mfoc"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Run Windows applications without a copy of Microsoft Windows
brew "wine"
# General-purpose lossless data-compression library
brew "zlib"
cask "1password"
cask "aliwangwang"
cask "burp-suite"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "fork"
cask "github"
cask "gnucash"
cask "google-chrome"
cask "hyper"
cask "insomnia"
cask "iterm2"
cask "keka"
cask "kobo"
cask "marp"
cask "microsoft-teams"
cask "minecraft"
cask "oracle-jdk"
cask "quip"
cask "sourcetree"
cask "steam"
cask "telegram"
cask "typora"
cask "visual-studio-code"
cask "wireshark"
mas "Disk Speed Test", id: 425264550
mas "Keynote", id: 409183694
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Nfc Ideas", id: 1245536234
mas "NFC Tools for Desktop", id: 1392471092
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "Trello", id: 1278508951
mas "熊掌記", id: 1091189122
