tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Command-line interface for SQLite
brew "sqlite"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# GNU binary tools for native development
brew "binutils"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Website copier/offline browser
brew "httrack"
# Configurable static site generator
brew "hugo"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql-client"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Run Windows applications without a copy of Microsoft Windows
brew "wine"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# General-purpose lossless data-compression library
brew "zlib"
# Azure Function Cli 2.0
brew "azure/functions/azure-functions-core-tools"
cask "1password"
cask "adobe-digital-editions"
cask "aerial"
cask "discord"
cask "docker"
cask "firefox"
cask "fork"
cask "gimp"
cask "gnucash"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "keka"
cask "kobo"
cask "logitech-options"
cask "microsoft-teams"
cask "minecraft"
cask "notion"
cask "oracle-jdk"
cask "powershell"
cask "spectacle"
cask "steam"
cask "telegram"
cask "tor-browser"
cask "tuxera-ntfs"
cask "typora"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "wireshark"
cask "x2goclient"
cask "xquartz"
mas "Amphetamine", id: 937984704
mas "Capo", id: 696977615
mas "Disk Speed Test", id: 425264550
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "KKBOX", id: 1105332179
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "SonicWall Mobile Connect", id: 822514576
mas "Sticky", id: 1218797101
mas "Tonebridge Guitar Effects", id: 1263858588
mas "Trello", id: 1278508951
mas "熊掌記", id: 1091189122
